In [226]:
#Importing and Start of Module 4 Challenge
import pandas as pd
import os

import warnings
warnings.filterwarnings("ignore")

student_data = os.path.join('Resources', 'new_full_student_data.csv')

student_df = pd.read_csv(student_data)

student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [227]:
student_df["student_name"]

0           Travis Martin
1           Michael Brown
2         Gabriela Lucero
3        Susan Richardson
4            Sherry Davis
               ...
19509       Robert Sawyer
19510        David Herman
19511          Megan Gill
19512          Lori Stone
19513         Anna Jensen
Name: student_name, Length: 19514, dtype: object

In [228]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [229]:
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [230]:
student_df.duplicated().sum()

1836

In [231]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [232]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [233]:
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [234]:
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [235]:
student_df['grade'] = student_df['grade'].astype('int64')
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [255]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

In [237]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [238]:
student_df.mean()

student_id       6.975296e+07
grade            1.035554e+01
reading_score    7.235787e+01
math_score       6.467573e+01
school_budget    8.937427e+05
dtype: float64

In [239]:
student_df.max()

student_id               129999733
student_name              Zoe Dunn
grade                           12
school_name      Woods High School
reading_score                100.0
math_score                   100.0
school_type                 Public
school_budget               991918
dtype: object

In [240]:
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [241]:
student_df['grade'].iloc[0:99999]

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [242]:
student_df.loc[0:2,["school_name","math_score","reading_score"]]

            school_name  math_score  reading_score
0  Sullivan High School        88.2           59.0
1     Dixon High School        73.5           94.7
2    Wagner High School        70.4           89.0

In [243]:
grade_nine_df = student_df.loc[student_df['grade'] == 9]
grade_nine_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [244]:
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [245]:
student_df.loc[student_df["school_name"] == "Green High School", "math_score"].mean()

66.22417134115236

In [246]:
tg_student_reading_scores_df = student_df.loc[student_df['grade'] == 10]
tg_student_reading_scores_df = tg_student_reading_scores_df.loc[0:99999,["school_name","reading_score"]]
tg_reading_scores_dfs = tg_reading_scores_df.loc[tg_reading_scores_df['school_name'] == 'Dixon High School']
tg_reading_scores_dfs

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [247]:
eg_student_df = student_df.loc[student_df['grade'] == 11]
tg_student_df = student_df.loc[student_df['grade'] == 12]
etg_student_df = [eg_student_df,tg_student_df]
etg_mean_reading_score_df = pd.concat(etg_student_df)["reading_score"].mean()
etg_mean_reading_score_df

74.90038089192213

In [248]:
avg_budget_by_school_type = student_df.groupby(by='school_type').mean()
avg_budget_by_school_type.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [252]:
student_count_df = student_df.groupby('school_name').count().sort_values(by='student_id',ascending=False).loc[:,'student_id']
student_count_df

school_name
Montgomery High School    2038
Green High School         1961
Dixon High School         1583
Wagner High School        1541
Silva High School         1109
Woods High School         1052
Sullivan High School       971
Turner High School         846
Bowers High School         803
Fisher High School         798
Richard High School        551
Campos High School         541
Odonnell High School       459
Campbell High School       407
Chang High School          171
Name: student_id, dtype: int64

In [250]:
student_df.groupby(['school_type','grade']).mean().loc[:,'math_score'].round()

school_type  grade
Charter      9        70.0
             10       66.0
             11       68.0
             12       60.0
Public       9        64.0
             10       64.0
             11       59.0
             12       64.0
Name: math_score, dtype: float64

In [256]:
# There were quite a few null values through-out the math and reading scores data that I was curious about. It perhaps would
# have been better to try and understand why those values were there instead of just dropping them immediately.
# You can also see that charter schools tend to be smaller in student size and also budget size. It would be interesting
# to see what percentage graduate from these two types of schools. Unfortunatley we don't have that data, but if we went off of
# math scores and reading scores only maybe we can make an assumptions of how many students possibly graduated?